{
  "films": [
    {
      "titre": "The Shawshank Redemption",
      "realisateur": "Frank Darabont",
      "annee": "1994",
      "genre": [
        "Drame"
      ],
      "synopsis": "The Shawshank Redemption (1994) raconte l'histoire d'Andy Dufresne, un banquier accusé à tort du meurtre de sa femme et de son amant, condamné à deux peines de prison à vie à Shawshank. Là, il se lie d'amitié avec Ellis 'Red' Redding, un détenu expérimenté, et trouve des moyens de survivre à la brutalité de la prison. Grâce à ses compétences en comptabilité, Andy gagne la confiance des autorités pénitentiaires et parvient à accomplir des actions extraordinaires. Le film explore des thèmes d'espoir, de rédemption et d'amitié, culminant avec une évasion audacieuse qui illustre la force de l'esprit humain face à l'injustice.",
      "affiche": "https://dp9a3tyzxd5qs.cloudfront.net/the-shawshank-redemption-1994-7.jpg",
      "duree": "2h22",
      "id": "1"
    },
    {
      "id": "3",
      "titre": "The Dark Knight",
      "realisateur": "Christopher Nolan",
      "annee": 2008,
      "synopsis": "The Dark Knight (2008) suit Batman dans sa lutte pour protéger Gotham City face à la montée du chaos orchestré par le Joker, un criminel imprévisible et sadique. Alors que le Chevalier Noir, avec l'aide du commissaire Gordon et du procureur Harvey Dent, tente de démanteler les organisations criminelles de la ville, le Joker pousse Gotham au bord de l'anarchie et force Batman à affronter des dilemmes moraux déchirants. Ce film explore des thèmes de justice, de sacrifice et de la dualité entre héros et anti-héros dans une quête pour sauver une ville rongée par la corruption.",
      "genre": [
        "Action",
        "Crime",
        "Drame"
      ],
      "duree": "2h32",
      "affiche": "https://thumb.canalplus.pro/http/unsafe/1440x810/filters:quality(80)/img-hapi.canalplus.pro:80/ServiceImage/ImageID/52831084"
    }
  ],
  "users": [
    {
      "id": "1",
      "username": "admin123",
      "userpassword": "1234",
      "type": "admin"
    },
    {
      "id": "2",
      "username": "user123",
      "userpassword": "1234",
      "type": "user"
    },
    {
      "id": "232e",
      "username": "tom",
      "userpassword": "Dragon2000!",
      "type": "user"
    },
    {
      "id": "f2c6",
      "username": "tom24",
      "userpassword": "Dragon2000!",
      "type": "user"
    }
  ]
}